gen_case_ahmed/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     simpleFoam; // solver

startFrom       latestTime;

startTime       0;

stopAt          endTime;

endTime         1000.0;

deltaT          1;

writeControl    timeStep;

writeInterval   50; // write interval

purgeWrite      0;

writeFormat     ascii;

writePrecision  8;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;
//////////////////////////////////////////////////////////////////////////////////
functions
{
  #include "forceCoeffsIncompressible";
  #include "forceIncompressible";
}


// ************************************************************************* //
