gen_case_ahmed/system/forceIncompressible
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/

forceIncompressible
{
	// Calculate forces
	type forces;
	functionObjectLibs ("libforces.so");

	enabled     	true;
	log         	yes;

	writeControl    timeStep;
	writeInterval   1;

	patches 	("ahmed.*"); // patch names to include

	pName 		p;
	Uname 		U;

	rho 		rhoInf;
	rhoInf 		1.225;

	CofR 	(0 0 0); // centre of rotation
}
