gen_case_ahmed/system/meshQualityDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      meshQualityDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// Include defaults parameters from master dictionary
#includeEtc "caseDicts/mesh/generation/meshQualityDict"

//- Maximum non-orthogonality allowed. Set to 180 to disable.
maxNonOrtho 75; 

//- Max skewness allowed. Set to <0 to disable.
maxBoundarySkewness 4;	//original 20

//- minFaceWeight (0 -> 0.5)
minFaceWeight 0.02;


// ************************************************************************* //
